app/controllers/pages_controller.rb

SELECT `articles`.* FROM `articles`
---
	def index
		@articles = Article.all()

SELECT `articles`.* FROM `articles`
---
	def research_center
		@articles = Article.all()